Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཏདྱ་ཐཱ། ཧི་ལི་ཧི་ལི། མི་ལི་མི་ལི། མ་ཧཱ་པྲ་བྷ།
en: Hara hara, mara mara, turu turu!

source: སུ་བི་མ་ལེ། བྲཧྨ་བི་ཥ་དྷ་རེ་ས་མ་ཏི་བ་ར་ཏེ། ཏུ་རུ་ཏུ་རུ།
en: Take delight in the essence of Amogha!

source: པི་ཙི་ཏྲ་པུཥྤ་མཱ་ལྱ་བྷི་བྷུ་ཥི་ཏེ།
en: Accept from me these fine flowers!

source: ཧ་ར་ཧ་ར། མ་ར་མ་ར།
en: Svāhā! “

source: ཏུ་རུ་ཏུ་རུ། ཨ་མོ་གྷ་ཧྲྀ་ད་ཡ། པྲ་མོ་ད་ན་ཀུ་རུ་པྲ་པྲ་ཏཱིཙྪ་མ་མུ་བུཥྤ་བ་རེ་སྭཱ་ཧཱ། མེ་ཏོག་ལ་ལན་བདུན་བཟླས་ཏེ་དབུལ་བར་བྱའོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ།
en: The vidyā holder should offer flowers incanted with this mantra seven times. “

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། མ་ཧཱ་བོ་དྷི་ས་ཏྭཱ་བ་ར་དེ། སྨ་ར་སྨ་ར། བྷ་ག་བཱ་ན།
en: Remember, remember the samaya of the Blessed One!

source: ས་མ་ཡ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཤཱ་སི་ཏེ།
en: You obtain comfort from all tathāgatas.

source: བྷ་ག་བཱ་ན། ཨ་བ་ལོ་ཀཱ་ཡ།
en: Look at the Blessed One!

source: སརྦ་ས་ཏྭཱ་ཨ་བ་ལོ་ཀ་ནི།
en: You watch over all beings.

source: ཨ་མོ་གྷ་བ་ཏི་པྲ་ཤ་ཧ་སྟེ།
en: You are endowed with the amogha quality.

source: སིད་དྷེ་སིད་དྷེ་སིད་དྷེ་བ་ར་དེ།
en: You with the noose in your hand, you are accomplished, you are!

source: སིད་དྷྱན་ཏུ་ཏེ།
en: You have accomplished your vow.

source: བུད་དྷ་དྷརྨ་སཾ་གྷ་ས་ཏྱེ་ན་ཏུ་རུ་ཏུ་རུ་ས་ཏྱ་ས་མ་ཡ་པཱ་ལཱ་ཡ་སྭཱ་ཧཱ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དྲན་པར་བྱ་བའི་རིག་སྔགས་སོ།
en: By the truth of the Buddha, the Dharma, and the Saṅgha, bhuru bhuru!

source: །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ།
en: Svāhā to the protector of the true samaya! “

source: བོ་དྷི་ས་ཏྭཱ་ཡ། མ་ཧཱ་ས་ཏྭཱ་ཡ།
en: The vidyā for the bali offering: “Homage to the Three Jewels!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ།
en: Homage to the great bodhisattva being, Noble Avalokiteśvara of great compassion! [

source: ཏདྱ་ཐཱ། དྷུ་རེ་དྷུ་རེ་བཛྲ་དྷར་པདྨ་ཛ་བེ། བི་ག་ཏཱ་བ་ར་དེ་བེ་ག་བེ་ག །
en: 173] “Dhure dhure, vajra­dharapadma­jaye vigatavā­varade!Vega vega, dhuṭa dhuṭa, sarvabījapriye!

source: དྷུ་ཊུ་དྷུ་ཊུ།
en: By the truth of the Buddha, the Dharma, and the Saṅgha, mili mili!

source: སརྦ་བཱི་ཛ་པྲི་ཡེ།
en: Svāhā! “

source: བུད་དྷ་དྷརྨ་སཾ་གྷ་ས་ཏྱེ་ན། མི་ལི་མི་ལི་སྭཱ་ཧཱ། གཏོར་མའི་སྔགས་ཏེ་ལན་བདུན་བཟླས་ཏེ་སྦྱིན་ནོ།
en: The vidyā holder should offer bali incanted with this mantra seven times. “

source: ན་མོ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ།
en: Homage to the great bodhisattva being, Noble Avalokiteśvara of great compassion! [

source: མ་ཧཱ་ཀུ་རུ་ཎི་ཀཱ་ཡ།
en: You on a lotus seat, with lotus-like arms, a white body, and white arms, adorned with white garlands!

source: ཨ་པྲ་ཏི་ཧ་ཏ། ཏ་ཐཱ་ག་ཏ་ཛྙཱ་ན་ཀཱ་ཡ།
en: Dhuma dhuma!

source: བྷ་ག་བཱ་ན།
en: Burn!

source: ཨཱ་ཧ་ར་ཨཱ་ཧ་ར་པདྨཱ་ས་ན་པདྨ་བྷུ་ཛེ།
en: By the truth of the Buddha, the Dharma, and the Saṅgha!

source: ཤྭེ་ཏཾ་གེ་ཤྭེ་ཏ་སུ་ཛེ་ཤྭེ་ཏ་མཱ་ལྱ་བི་བྷཱུ་ཥི་ཏེ།
en: Svāhā! “

source: དྷུ་མ་དྷུ་མ་ཛྭ་ལ་བུ་དྷ་དྷ་རྨ་སཾ་གྷ་ས་ཏྱེ་ན་སྭཱ་ཧཱ། མར་མེའི་རིག་སྔགས་ཏེ་ལན་བདུན་བཟླས་པས་སོ།
en: The vidyā of lamps should be recited seven times. “

source: བོ་དྷི་སཏྭཱ་ཡ།
en: 175] “Oṁ, Hero!

source: མ་ཧཱ་སཏྭཱ་ཡ།
en: Hero Padmapāṇi!

source: ཏདྱ་ཐཱ།
en: You have accomplished the amogha nature.

source: ཨོཾ་བི་རི་བི་རི།
en: You are impelled by the rays of light in the sky of all the tathāgatas.

source: པདྨ་པཱ་ཎི་ཨ་ག་མཱ་ག་མ་ཨ་མོ་གྷ་ཏ་ཏཱ་སིད་དྷི་སརྦ་ཏ་ཐཱ་ག་ཏ་ག་ག་ན་རཤྨི་སཉྩོ་དི་ཏེ།
en: You purify all the vidyā holders.

source: སརྦ་བི་དྱཱ་དྷ་ར་བི་ཤོ་དྷ་ནི།
en: You have accomplished the blazing amogha light.

source: ཨ་མོ་གྷ་སིད་དྷི་སྭཱ་ཧཱ།
en: Svāhā! “

source: སྤོས་ཆུའི་དྲི་ཞིམ་པོའི་བུམ་པ་ལ་ལན་བདུན་བཟླས་ཏེ་ཁྲུས་བྱའོ། །ཁྲུས་ཀྱི་རིག་སྔགས་སོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ།
en: The vidyā holder should incant a jar of scented water with this mantra seven times and then wash himself with it. “

source: དྷུ་མེ་དྷུ་མེ་དྷུ་དྷུ་མེ་པདྨེ་པདྨ་ནི་ར་བྷཱ་སེ།
en: You are pure like a lotus, pure and immaculate with a golden hue.

source: ཤུད་དྷ་ཤུད་དྷ་ཀ་བ་ཙ་ན་པྲ་བྷཱ་ས་བི་མ་ལེ།
en: You are the purity of pure essences, the purity within the pure sphere!

source: ཤུད་དྷ་རཱ་ཤི །
en: O lotus-limbed one!

source: ཤུ་ཙི་ཤུ་ཙི་ཤུ་ཙི་གོ་ཙ་ར་སིད་དྷི་པདྨ་མཱཾ་ག་བ་ཏི།
en: You clothe beings in clothes.

source: པྲ་བ་ར་ཎི་སྭཱ་ཧཱ།
en: Svāhā! “

source: གོས་ཀྱི་རིག་སྔགས་ཏེ་ལན་བདུན་བཟླས་པས་སོ།
en: The vidyā of clothing should be recited seven times. “

source: ཤཱ་མེ་ཤཱ་མ་ཡ་ཤཱ་ན་ཏེ་མེ།
en: Please purify all my wrongdoings!

source: མ་མ་སྦ་སྟྱ་ནཾ་ཀུ་རུ་ཤཱ་ན་ཏོ་སི་མི་སརྦ་པཱ་པ།
en: You are peaceful, pure, auspicious, and immaculate!

source: ཤཱན་ཏ་ཤུད་དྷ་ཀ་ལྱཱ་ཎ་བེ་ར་ཛེ།
en: You win through peace; yours is the perfect victory!

source: ཤཱན་ཏི་བི་ཛ་ཡེ།
en: O Noble Lord Avalokiteśvara, move, move!

source: ཛ་ཡ་སིད་དྷེ་བྷ་ག་བཱ་ན་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་ར་ས་ར་སྭཱ་ཧཱ།
en: Svāhā! “

source: མལ་ཆ་ལ་བསྔགས་ཏེ་ཉལ་ན་རྨི་ལམ་ངན་པ་དང་། ལྟས་ངན་པ་ཐམས་ཅད་མི་མཐོང་ངོ་། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ། བོ་དྷི་ས་ཏྭཱ་ཡ།
en: If the vidyā holder sleeps on a bed or couch incanted with this vidyā, he will not have any bad dreams or see bad omens. “

source: ནཱ་ག་པྲཱ་ཀ་ར་ཥ་ཎེ།
en: O carrier of water!

source: དི་པྱ་ཛ་ལ།
en: You purge the water of serpent-demons and remove the danger of rough waters.

source: ཛ་ལཱ་བ་ཧེ།
en: You are the water in the lotus pond, pure as lotuses!

source: ཛ་ལ་སཾ་ཀྵོ་བྷ་ཡཾ་ནཱ་ག་ཛ་ལ་སཾ་ཤོ་དྷ་ནི་པདྨ་ས་རེ།
en: You are the water for the hands.

source: པདྨ་བི་ཤུདྡྷེ།
en: Please purify the body!

source: པཱ་ཎི་ཛ་ལི་སཾ་ཤོདྷ་ཡ།
en: Vara vara, O water!

source: ཨཱཏྨ་ནཾ་དྷ་ར་དྷ་ར་ས་ལི་ལེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: ཆུའི་སྔགས་ཏེ་ཁྲུས་དང་དབང་བསྐུར་བའི་ཆུ་བླངས་ལ་ལན་བདུན་བཟླས་ཏེ་སྤྱད་དོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ནམ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ། བོ་དྷི་ས་ཏྭཱ་ཡ། མ་ཧཱ་ས་ཏྭཱ་ཡ།
en: The vidyā of water, used for bathing, drawing, and sprinkling, should always be recited seven times. “

source: སརྦ་ས་ཏྭཱྃ་ཧི་ཏཾ་ཀ་རཱ་ཡ།
en: Homage to the great bodhisattva being, Noble Avalokiteśvara of great compassion, who benefits all beings, who grants them amogha boons, who gives food and drink to all beings, and who gives food of various flavors to devas, nāgas, and so forth! [

source: ཨ་མོ་གྷ་བར་པྲ་དཱ་ཡ།
en: 179] “O goddess of the entire world!

source: སརྦ་ས་ཏྭཱྃ་མན་ན་པཱ་ན་པྲ་དཱ་ཡ། དེ་བ་ནཱ་བཱ་ད་ཡཱ་བྷོ་ཛྱ་བི་དྷི་དྷ་ར་མ་ནུ་པྲ་དཱ་ཡ།
en: You purify the world and satiate it, O pure, most eminent one!

source: ས་ཀ་ལ་བྷུ་བ་ནེ། བྷུ་བ་ན་བི་ཤོ་དྷ་ནི། སན་ཏརྦ་ཡ་པྲ་བྷ་ར་བི་ཤུད་དྷེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: དབུལ་བའི་སྔགས་སོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ།
en: The vidyā for casting off used garlands: “Homage to the Three Jewels!

source: སརྦ་དེ་བཱ་སུར་ན་མ་སྐྲྀ་ཏེ། ས་མས་མན་ཏ་པྲ་པཱུ་ར་ཎེ།
en: You are perfumed with every fragrance!

source: ས་མ་གན་དྷཱ་བ་བྷཱ་སི་ཏེ། ག་ག་ན་བི་ཤུད་དྷེ།
en: You possess the purity of the sky!

source: མུག་ཏི་པྲ་བྷེ།
en: You are the light of liberation!

source: ཛ་ཡེ་བི་ཛ་ཡེ། ཛ་ཡ་ནིར་མཱ་ལྱོ་པན་ཡ་ཏི། བུཥྤ་མཱ་ལྱ་གན་དྷ་བི་ཤོ་དྷ་ན།
en: O victorious goddess of victory, the provider of discarded garlands!

source: བི་ཤོ་དྷ་ཡ། སརྦ་ཏ་ཐཱ་ག་ཏ་བི་ཤུད་དྷེ་པདྨ་བི་ཤོ་དྷ་ནི་སྭཱ་ཧཱ། མེ་ཏོག་ཉིད་དོར་བའི་རིག་སྔགས་སོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ།
en: You purify the scent of flowers in the discarded garlands; purify it!

source: དྷ་ར་ཎི་ན་དྷ་རེ་དྷ་ར་ཎི་བན་དྷེ།
en: Arrest it, arrest, O semen purifier!

source: བན་དྷ་བན་དྷ་ཤུ་ཀྲ་བི་ཤོ་དྷ་ནི།
en: Marked with a white garland, you are the purifier of semen.

source: ཤུ་ཀྲ་མཱ་ལ་ལིང་གི་ཏི།
en: O purity of the semen!

source: ཤུ་ཀྲ་བི་ཤོ་དྷ་ནི། ཤུད་དྷ་བི་མ་ལེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: རྩྭ་ཀུ་ཤའམ་རས་ཀྱི་སྲད་བུའམ། བུ་མོ་གཙང་མས་བཀལ་བའི་སྲད་བུ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ། མདུད་པ་ཉི་ཤུ་རྩ་གཅིག་བོར་བ་བྱས་ན། ཁུ་ཆུ་འགགས་པར་འགྱུར་རོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ།
en: If the vidyā holder ties twenty-one knots in a wisp of kuśa grass, a woven thread, or a thread spun by a virgin girl, incanted with this vidyā twenty-one times, the semen will be arrested. “

source: ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ། བོ་དྷི་ས་ཏྭཱ་ཡ།
en: The vidyā of warding off vighnas and vināyakas: “Homage to the Three Jewels!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། ཏདྱ་ཐཱ།
en: 182] “O blazing blaze!

source: ཛྭ་ལེ་ཛྭ་ལེ། བི་མ་ལེ་ཛྭ་ལེ།
en: O immaculate blaze!

source: པྲ་བྷ་སི་བི་ར་ཛ།
en: You are like the sun, powerful and pure!

source: སཱུརྱ་བ་ཏི་ཛ་ཡ་པདྨ།
en: Be victorious, O wearer of lotus garlands!

source: མཱ་ལ་དྷ་རེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: མེའི་སྦྱིན་སྲེག་གི་ཐལ་བ་ལ་ལན་བདུན་བཟླས་ཏེ་ཀུན་དུ་གཏོར་ན། བགེགས་དང་ལོག་འདྲེན་ཐམས་ཅད་ཀྱིས་ནམ་ཡང་མི་ཚུགས་སོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ། བོ་དྷི་ས་ཏྭཱ་ཡ་མ་ཧཱ་ས་ཏྭཱ་ཡ།
en: If the vidyā holder incants the ashes left after the fire sacrifice seven times with this vidyā and strews them all around, the vighnas and vināyakas will never come again. “

source: ཛ་ལེ་ཛ་ལེ།
en: 183] “Water, water!

source: ཛ་ལ་བ་ཏི།
en: Rich in water!

source: ཛ་ལ་པྲ་བྷ་བ་ནི།
en: Source of water!

source: ནཱ་ག་སྲ་བ་ཎི་དི་པྱ་བཱ་རི་ཎི།
en: The swimming place of nāgas!

source: མི་ལི་མི་ལི་སྭཱ་ཧཱ། ཉེ་རེག་གི་རིག་སྔགས་སོ།
en: O divine water!

source: བོདྷི་ས་ཏྭཱ་ཡ།
en: The vidyā of the seat: “Homage to the Three Jewels!

source: ཏདྱ་ཐཱ། རི་ཎི་ཧ་རི་ཎི་པིང་ག་ལེ་པིང་ག་ལེ།
en: Yellow like piṅgala!Hiri hiri!

source: ཧི་རི་ཧི་རི། བྷ་ག་བཱན།
en: Stir, O Lord, stir and remain!

source: ནི་ཙ་ལ་པྲ་ཙ་ལ།
en: Protect me, protect!

source: པྲ་ཏི་ཏིཥྛ་མཱཾ་རཀྵ་མ་མ་བུད་དྷ་དྷརྨ་སང་གྷ་ས་ཏྱེ་ན་སྭཱ་ཧཱ།
en: By the truth of the Buddha, Dharma, and Saṅgha, svāhā! “

source: སྟེགས་བུའམ་རྩྭ་ཀུ་ཤ་བཏིང་བ་ལན་བདུན་སྔགས་སོ།
en: The vidyā holder should incant the seat of kuśa grass with this vidyā of the seat seven times. “

source: །སྟན་གྱི་རིག་སྔགས་སོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ།
en: The vidyā of Padmasundarī: “Homage to the Three Jewels!

source: ན་མཿསརྦ་མཎྜ་ལ་ནི་བ་སིན་དེ་བ་ཏཱ་ནཱཾ་མོ་བིདྱཱ་དེ་བ་ཏཱ་ནཱཾ།
en: Homage to all the deities of the maṇḍala!

source: སརྦ་ཀལ་བ་སིད་དྷཱ་ནཱཾ།
en: Homage to the vidyā deities who accomplish every rite!

source: ཨེ་ཧྱེ་ཧི་བྷ་ག་བ་ཏེ་པདྨ་སུན་ད་རི།
en: Move, move, O swift Padmasundarī!

source: མ་ཧཱ་བིདྱཱ་དེ་བ་ཏི། ཙ་ལ་ཙ་ལ། པདྨ་སུན་དྷ་རི།
en: Huru huru!

source: བེ་ག་བ་ཏི། སུ་རུ་སུ་རུ་སྭཱ་ཧཱ།
en: Svāhā! “

source: ཉིན་རེ་ཞིང་མེ་ཏོག་དང་། བདུག་པ་དང་། གཏོར་མ་དང་། སྤོས་ཆུས་ཕོ་ཉ་མོ་པདྨའི་རིགས་མཛེས་པ་དང་གནོད་སྦྱིན་མོ་རལ་པ་གཅིག་མ་མཆོད་ནས། བཟླས་བརྗོད་ལན་བདུན་བྱས་ན།
en: The vidyā holder should worship Padmasundarī, the rākṣasī Ekajaṭā, and Kṛtyā every day with offerings of flowers, incense, bali, fragrances, and so forth incanted seven times with this vidyā.

source: ནམ་ཡང་བགེགས་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་སོ།
en: No vighnas will ever come again. “

source: ན་མཿཀྲོ་དྷ་རཱ་ཛཱ་ཡ།
en: Homage to Krodharāja!

source: ནམཿསརྦ་བིདྱཱ་ཀུ་ལ་བཾ་ཤ་སྱ། ཏདྱ་ཐཱ། ཨོཾ་ཨ་མོ་གྷ་ཧྲྀ་ད་ཡ་པྲ་བྷ་བི་ནི། སརྦ་བི་གྷྣཾ་པྲ་ཤ་མ་ནི།
en: Bring them over!

source: ཨཱ་ཧ་ར། སཾ་ཧ་ར།
en: Bring them together!

source: པདྨ་པཱི་ཐོ྅་བ་བིཥྚེ། མ་ཎི་ཀ་ཎ་ཀ་བི་བྷཱུ་ཥི་ཏ། ཀ་མ་ལ་བྷུ་ཛེ།
en: You sit on a lotus seat, your lotus arms adorned with jewels and gold!

source: ཏ་ར་ཏ་ར་ཏཱ་རཱ་ཡ་བར་མ།
en: Carry across, carry across!

source: ཨ་མོ་གྷ་ཧྲྀ་ད་ཡ།
en: Deliver from evil!

source: ཛ་ཡེ་ཏྲི་ནེ་ཏྲེ། བར་ད་བྷུ་ཛེ།
en: You are the victorious amogha essence!

source: སྨ་ར་སྨ་ར།
en: O three-eyed one with hands that grant boons!

source: བྷ་ག་བཱ་ན། སརྦ་ཏ་ཐཱ་ག་ཏ་ས་མ་ཡ།
en: Remember, remember the samaya of all the blessed tathāgatas!

source: བྷ་ར་བྷ་ར། བྷུ་རུ་བྷུ་རུ། བྲཧྨ་བྷེ་ཥ་དྷ་ར་བི་བྷུ་ཥི་ཏ་ཏ་ནུ།
en: Wear, wear, bhuru bhuru, O wearer of the garb of Brahmā whose body is adorned!

source: མ་ཧཱ་བྷ་ཡ་ཧ་རེ། ཨཱ་ལོ་ཀ་ཡ།
en: You are the great remover of fear!

source: བི་ལོ་ཀ་ཡ།
en: Look at and watch over them, you who watch over all beings!

source: སརྦ་ས་ཏྭཱ་བ་ལོ་ཀི་ནི། བར་བར་དེ་སྭཱ་ཧཱ།
en: Vara vara, O boon giver!Svāhā! “

source: ལས་ཐམས་ཅད་བའི་རིག་སྔགས་ཏེ།
en: This vidyā is suitable for all activities.

source: ཁྱད་པར་དུ་ནི་རིག་སྔགས་འདིས་དཀྱིལ་འཁོར་གྱི་གནས་ན་འཁོད་པའི་ལས་མི་རྣམས་བསྲུང་བར་བྱའོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་ར་ཡ། བོ་དྷི་སཏྭཱ་ཡ། མ་ཧཱ་ས་ཏྭཱ་ཡ།
en: In particular, it affords protection during sādhanapractice by employing the many attendant vidyās dwelling within the maṇḍala. “

source: པ་ར་པ་ར། མ་ར་མ་ར། ས་ར་ས་ར། བན་དྷ་བན་དྷ། ས་མན་ཏེ་ན། ཨ་མོ་གྷ་བཱ་ཤ་ཧ་སྟེ།
en: 187] “Para para, mara mara, bind, bind everywhere, you with the unfailing noose in your hand!

source: ཨ་མོ་གྷ་བཱ་ཤ་ཧ་སྟེ། ཏིཥྛ་ཏིཥྛ།
en: Remain, remain!

source: བུད་དྷ་དྷརྨ་སཾ་གྷ་ས་ཏྱེ་ན་སྭཱ་ཧཱ།
en: By the truth of the Buddha, the Dharma, and the Saṅgha, svāhā! “

source: ཐལ་བ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ་དོན་ཡོད་ཞགས་པའི་ཕྱག་རྒྱས་ཡུལ་བཅིང་ངོ་། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ།
en: The vidyā holder should bind the maṇḍala by scattering the ashes incanted with this vidyā twenty-one times while displaying the mudrā of Amoghapāśa. “

source: ཏདྱ་ཐཱ། དི་ཤཱ་བན་དྷ་ན། ཨ་མོ་གྷེ།
en: 188] “You bind the directions, O unfailing and perfect one!

source: ཨ་པྲ་ཏི་ཧ་ཏེ། མུ་རུ་མུ་རུ། སུ་རུ་སུ་རུ། ཏུ་རུ་ཏུ་རུ།
en: Muru muru, suru suru, turu turu!

source: སརྦ་བི་གྷཾ་བི་ནཱ་ཤ་ནི། པདྨ་ས་ར་བི་བྷཱུ་ཥི་ཏེ།
en: O destroyer of all vighnas, adorned with lotus ponds!

source: བུད་དྷ་དྷརྨ་སཾ་གྷ་ས་ཏྱེ་ན་པན་དྷ།
en: By the truth of the Buddha, the Dharma, and the Saṅgha, please bind, O unconquerable giver of boons!

source: ཨ་ཛི་ཏ་བར་དེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: སྤྱན་དྲངས་ཏེ་ཕྱི་ནས་ཕྱོགས་བཅིང་བར་བྱའོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ།
en: The vidyā holder should bind the directions after summoning the deities. “

source: ཏདྱ་ཐཱ། ཧི་ལི་ཧི་ལི། མི་ལི་མི་ལི། སི་རི་སི་རི། པི་རི་པི་རི།
en: 189] “Hili hili, mili mili, siri siri, piri piri, move, move, move fast, O driver of the best of chariots!

source: བ་ར་བ་ར། པྲ་བར་བི་མཱ་ན་དྷ་ར།
en: Dara dara, go, go to the abode of Noble Lord Avalokiteśvara!

source: ད་ར་ད་ར། གཙྪ་གཙྪ་བྷ་ག་བཱ་ན། ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་ར་ཤཱུ།
en: Hurry, hurry, O bearer of the amogha lotus!

source: བྷ་ག་བཱན། ཏུ་རུ་ཏུ་རུ། ཨ་མོ་གྷ་པདྨེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: མེ་ཏོག་ཅི་སྙེད་པ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ་སཱིམ་བ་ནས་ཕུལ་ན་སླར་གཤེགས་སུ་གསོལ་བར་འགྱུར་རོ།
en: The vidyā holder should offer whatever flowers are available, held in his folded hands, after incanting them with this vidyā twenty-one times. He should then dismiss the deities. “

source: །རིག་སྔགས་ཀྱི་ཆོ་ག་ཞིབ་མོ་རིམ་པར་ཕྱེ་བའི་ཆོ་གའོ།། །།དེ་ནས་དོན་ཡོད་པའི་ཞགས་པའི་རྒྱལ་པོ་ཁྲོ་བོ་ཆེན་པོའི་སྙིང་པོའི་མཆོག་བསྒྲུབས་ན།
en: This was the ritual instruction on the vidyās. “

source: བསྒྲུབ་སླ་བའི་རས་ཀྱི་སྐུ་གཟུགས་ཀྱི་ཆོ་ག་བཤད་པར་བྱའོ། །ཆོ་ག་ཞིབ་གྲུབ་གྲུབ་པ་ཆེ། །ཁྲོ་བོའི་རྒྱལ་གྲུབ་གྲུབ་པ་མཆོག །
en: Now I will teach a ritual procedure that employs a painting and is easy to practice.

source: དོན་ཡོད་པ་ནི་གྲུབ་པའི་མཆོག །རིག་སྔགས་འདི་ནི་བཤད་པར་བྱའོ། །དོན་ཡོད་རྒྱལ་པོ་ཁྲོ་ཆེན་གྱི།
en: I will teach a heart mantra of Amogharāja, the great Krodharāja, that is supremely effective.

source: །སྙིང་པོ་དམ་པ་སྒྲུབ་པ་ནི། །ཆོ་ག་ཞིབ་གྲུབ་གྲུབ་པ་ཆེ། །ཁྲོ་བོའི་རྒྱལ་པོ་གྲུབ་པ་མཆོག །
en: The Krodharāja mantra accomplished in this rite constitutes the supreme accomplishment.

source: གྲུབ་པའི་མཆོག་སྟེ་དོན་ཡོད་པ། །རིག་སྔགས་འདི་ནི་བཤད་པར་བྱ།
en: I will now teach this vidyā that brings supreme amogha accomplishment.

source: །གང་བརྗོད་པ་ཙམ་གྱིས་ཆོ་ག་ཞིབ་མོའི་མཆོག་འགྲུབ་པ།
en: By merely repeating it, the vidyā holder can accomplish any rite.

source: སངས་རྒྱས་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གིས་གཟིགས་པར་འགྱུར་བ།
en: Able to see perfectly realized beings, he will behold hundreds of thousands of millions of buddhas.

source: རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་བརྒྱ་སྟོང་མཐོང་བར་འགྱུར་རོ། དེ་བཞིན་གཤེགས་པ་འབུམ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་བ། བསོད་ནམས་ཀྱི་ཕུང་པོ་བླ་ན་མེད་པ།
en: He will plant the roots of virtue and accumulate an amount of merit equal to that of hundreds of thousands of millions of buddhas, equal in number to the grains of sand in the Gaṅgā river.

source: སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་བ། སྟོབས་དང་བརྩོན་འགྲུས་བསྐྱེད་པ།
en: All his nonvirtue will be pacified, and his strength and courage will increase.

source: ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་དོན་ཡོད་པ། དེ་ཁོ་ན་ཉིད་སྒྲུབ་པ་འགྲུབ་པ།
en: He will succeed without fail in all rites and attain true accomplishment.”

source: དྲན་པ་ཙམ་གྱི་མོད་ལ་ནི། །ས་གཞི་ཡང་ནི་གཡོ་འགྱུར་ལ། །སུམ་ཅུའི་ལྷ་རྣམས་གཡོ་འགྱུར་ཞིང་། །ལྷར་བཅས་རྒྱ་མཚོ་ལྷུན་པོར་བཅས།
en: As soon as Noble Avalokiteśvara called the mantra to mind, the earth quaked, as did the heaven of Thirty-Three, the realms of the asuras, the oceans, and the mountains.

source: །ཀླུ་རྣམས་འདར་ནི་ཡེད་ཡེད་ཅིང་། །གནོད་སྦྱིན་སྲིན་པོ་འབྲོས་འགྱུར་བ།
en: The nāgas trembled, and the yakṣas and rākṣasas fled.

source: །ལྷ་དང་ལྷ་མིན་གཡུལ་འགྱེད་ཚེ། །རིག་སྔགས་རྒྱལ་པོ་བླ་མེད་ཀྱིས། །ཕྱག་ན་རྡོ་རྗེ་གནོད་སྦྱིན་བཅས། །དཔུང་དང་བཅས་ཤིང་བཞོན་བཅས་པའི། །ལུས་སྐྱེས་འབར་བའི་ཕྲེང་ཅན་ཀུན།
en: The supreme vidyārājas, engaged in the war between the gods and asuras, and Vajrapāṇi and the yakṣas with their mounts and chariots, all trembled and shook, with halos of flames appearing around their bodies.

source: །འདར་ཞིང་ཀུན་དུ་འདར་ཡེད་ཡེད། །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་ཡི། །གནས་མཆོག་དག་ནི་གཡོ་འགྱུར་ཞིང་།
en: The Four Great Kings and their finest palaces shook too.

source: །དེ་དག་ཐམས་ཅད་འདུས་འགྱུར་ནས། །འཇིག་རྟེན་དབང་ལ་སྐྱབས་དོང་ཞིང་། །བཅོམ་ལྡན་མགོན་པོ་བསྐྱབ་ཏུ་གསོལ། །ཐུགས་རྗེའི་བདག་ཉིད་བསྐྱབ་ཏུ་གསོལ།
en: All of them gathered together and approached the Lokeśvara for refuge, saying, “Protect us, O Blessed Lord whose very nature is compassion!”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག །བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The great bodhisattva being Noble Avalokiteśvara then approached the Blessed One and said, “O Lord, I have a king of vidyās that is the essence of Amoghasiddhi.

source: །བཅོམ་ལྡན་འདས་བདག་ལ་གྲུབ་པ་དོན་ཡོད་པའི་སྙིང་པོའི་རིག་སྔགས་རྒྱལ་པོའི་སྙིང་པོ་འདི་གང་གིས་བཀླགས་པ་ཙམ་གྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་མྱུར་དུ་རབ་ཏུ་འགྲུབ་ཅིང་།
en: By merely reciting it, one can swiftly accomplish the heart essence of Amoghapāśa.

source: དྲན་པ་ཙམ་གྱིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལྷའི་ལུས་ཀྱིས་ལུས་སྟོན་པར་འགྱུར་བ། དངོས་གྲུབ་དང་མཆོག་ཐམས་ཅད་སྦྱིན་པར་འགྱུར་བ་མཆིས་ཏེ།
en: Merely calling it to mind will grant the vision of Noble Avalokiteśvara in his divine nature and will bring every supreme accomplishment.

source: བཅོམ་ལྡན་འདས་དེ་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར། འཁོར་གྱི་དཀྱིལ་འཁོར་འདིའི་ནང་དུ་བསྒྲགས་པར་བགྱིའོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མཿཨ་མི་ཏཱ་བྷཱ་ཡ། ཏ་ཐཱ་ག་ཏཱ་ཡ།
en: Therefore, O Lord, I will now reveal it in this assembly here before you. “

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། ཏདྱ་ཐཱ། ཨོཾ་པདྨེ་པདྨེ།
en: 190] “Oṁ, lotus, lotus!

source: པདྨ་དྷ་ར་བི་བྷཱུ་ཥི་ཏ།
en: Your arms are adorned with the lotuses you hold.

source: བྷུ་ཛེ། ཙ་ར་ཙ་ར། བྲཧྨ་བེ་ཥ་དྷ་ར། བྷ་ར་དྷ་ར། བི་ཙི་ཏྲ་མཽ་ལ་དྷ་ར།
en: O wearer of the garb of Brahmā, wear, wear!

source: མ་ཎི་ཀ་ན་ཀ་བཛྲ་བཻ་ཌཱུརྱཱ་ལཾ་ཀྲི་ཏ་ཤ་རཱི་ར།
en: You have a bright diadem on your head, and your body is adorned with jewelry, gold, diamonds, and beryl stones.

source: ཏ་ར་ཏ་ར། ཏ་རཱ་ཡ་ཏ་རཱ་ཡ།
en: Please ferry us, ferry, O Blessed Lord and Lady!

source: བྷ་ག་བ་ཏེ་པཱ་ར་ཎ།
en: Help us cross to the other shore!

source: དྷུ་རུ་དྷུ་རུ། ཨ་མོ་གྷ་པཱ་ཤ་ཧ་སྟེ། བ་ར་བ་ར་བ་ར་དཱ་ཡ་ཀ །
en: Dhūru dhūru, you with the noose of Amogha in your hand!

source: ས་མན་ཏ་ཨ་བ་ལོ་ཀི་ཏེ། མ་ཧཱ་བོ་དྷི་ས་ཏྭ་བར་ད་པདྨཱ་སན་པདྨ་གཽར།
en: Vara vara, O boon giver with panoptic vision!

source: ཛྭ་ལ་ཛྭ་ལ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་བྷི་ཥེ་ཀ །
en: O great bodhisattva who grants boons, white as lotus and sitting on a lotus seat!

source: ཨ་བྷི་ཥེ་ཀ་ཏེ་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། བ་ལ་བ་ལ།
en: Blaze, blaze!

source: མ་ཧཱ་བེ་ག་དྷ་ར་བི་ཀྲྀ་ཏ་ན་ཡན།
en: You are consecrated by all the tathāgatas.

source: དཾ་ཥྜཱ་ཀ་རཱ་ལ་མ་ཧཱ་ཏེ་ཛཿདྷ་ར་དྷ་ར་བི་པུ་ལ་ཛ་ན་བ་ད་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ།
en: O most compassionate one!

source: མ་ཧཱ་པ་ཤུ་པ་ཏི་བེ་ཥ་དྷ་ར།
en: O strength, strength, great strength!

source: ས་ར་ས་ར།
en: O swift one!

source: པྲ་བར་པུ་ཎྱ་སམ་བྷཱ་ར།
en: With your face contorted in anger and fangs protruding, you possess great fiery energy.

source: སུ་ག་ཏ་དྷྱཱ་ན་ས་མཱ་དྷི།
en: Yours is a vast knowledge, O boon giver!

source: ས་མན་ཏ་ཨ་བ་ལོ་ཀི་ཏ།
en: Yours is great compassion, O wearer of the garb of the great Paśupati!

source: ཨཱི་ཤྭ་ར་མ་ཧེ་ཤྭ་ར། དུཥྚ་ད་མ་ཀ །
en: Move, move!

source: རཽ་དྲ་པྲ་ལ་ཡ་དམ་ཀ །
en: You are the best means of accumulating merit.

source: ཀྲོ་དྷ་རཱ་ཛ་མ་ཧཱ་བེ་ག་དྷ་ར།
en: Endowed with the meditative concentration and samādhi of a sugata, you can see everywhere!

source: ས་མ་ས་མ་མ་ཧཱ་སྟྲཱ་མ་པྲཱ་པྟ།
en: You are Īśvara and Maheśvara, the tamer of wicked beings!

source: ཙནྡྲ་སཱུརྱ་ཨ་ཏི་རེ་ཀ་པྲ་བྷ་མ་ལ་མ་ལ་སརྦ་མ་ལ་བི་ཤོ་དྷ་ཀ་སརྦ་རྀ་ཥི་ག་ན་སན་ཏ་ཏི་མ་ཧཱ་མ་ཧེ་ཤྭ་ར་རཱུ་པ་དྷ་ར།
en: You are the fierce tamer of the deities of dissolution, the great wearer of the garb of the lord of wrath!

source: ཨ་མི་ཏཱ་བྷ་ཛི་ནཱ་ལང་ཀྲྀ་ཏ་ཛ་ཊ།
en: Sama sama!

source: དཀྵི་ན་ཙནྡྲཱ་ལཾ་ཀྲྀ་ཏ་ཤི་རཿ།
en: You possess great tenacity, and your splendor exceeds that of the moon and the sun.

source: མ་ཐ་མ་ཐ།
en: Mala mala, you purify all impurities.

source: སརྦ་ཡཀྵ་རཱཀྵ་བྷཱུ་ཏ་ག་ཎ་བྷཉྫ་ཀ་ཏ་ར།
en: You are the wearer of the great garb of Maheśvara surrounded by multitudes of gaṇas and ṛṣis.

source: ཏ་ར་ཏ་ར་ག་ཎ་ས་མཱ་ལཾ་ཀྲྀ་ཏ།
en: Your topknots are adorned with the victorious Amitābha, your right head with the moon.

source: ནཀྵ་ཏྲ་མཱ་ལ་སརྦ་བི་གྷྣཱ་ན་བི་ནཱ་ཤ་ན་ཀ་ར།
en: Crush them, crush, O destroyer of the hordes of all yakṣas, rākṣasas, and bhūtas.

source: པ་ར་མཻ་ཏྲི་ཙིཏྟ་མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ།
en: Ferry across, ferry across, you who are adorned with a multitude of stars and garlanded with constellations!

source: བ་ར་པ་ར།
en: O you whose thoughts are filled with supreme love, who has great compassion, and who is the bringer of ruin upon all the vighnas.

source: པ་རི་པཱུ་རྣ་མཎྜལ་སཽ་མྱ་མུ་ཁ། ཥ་ཊ་བཱ་ར་མི་ཏཱ། པ་རི་པཱུ་ར་ཀ །མི་ལི་མི་ལི།
en: Para para, you who comprise the full maṇḍala!

source: ཨེ་ཎེ་ཡ་ཙརྨ་ནི་བཱ་ས་ན།
en: Happy and at ease, you fully accomplish the six perfections.

source: བཱ་གྷྲ་ཙརྨོ་ཏ་ཏ་རི་ཡ། དྷ་ར་དྷ་ར། སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་བ་ལོ་ཀི་ཏ།
en: Mili mili!

source: ཏྲི་ནེ་ཏྲ་ཏྲི་ཤཱུ་ལ་དྷ་ར། བཛྲ་ཛྭ་ལ་དྷ་ར།
en: O wearer of the tunic made from the skin of a black antelope and an upper garment made of a tiger skin, wear, wear!

source: ཨ་མོ་གྷ་པྲ་ཤ་ཧ་སྟེ།
en: Your gaze, O three-eyed one, is that of all the tathāgatas.

source: ཡ་མ་བ་རུ་ཎ་ཀུ་བེ་ར་རཱུ་པ་དྷ་ར།
en: You carry a trident, a blazing vajra, and an unfailing noose in your hand.

source: ནཱ་གེ་ན་དྲ་རཱུ་པ་དྷ་ར།
en: You assume the forms of Yama, Varuṇa, and Kubera, and also of the nāga kings.

source: བི་མ་ལ་བི་ཤུད་དྷ་དེ་ཧ་སརྦ་པཱ་བ་ཤ་མ་ཀ་སརྦཱ་བ་ར་ཎི་བི་ཤོ་དྷ་ཀ །
en: Your body is immaculately pure, and you pacify all nonvirtue, purify all obscurations, and remove all evil.

source: སརྦ་ཀི་ལི་བི་ཥ་ནཱ་ཤ་ཀ །སྟྲཻ་ལོ་ཀྱ་བ་ཤཾ་ཀ་ར། སརྦ་ས་ཏྭཱ་བི་ཤོ་དྷ་ཀ །
en: You enthrall the three worlds and purify all beings.

source: བོ་དྷི་ས་ཏྭཱ་བ་ར་ད།
en: Blessed by all tathāgatas, you grant the bodhisattva boon of awakening.

source: སརྦ་ཏ་ཐཱ་ག་ཏ། ཨ་དྷིཥྛི་ཏེ། ཨོཾ་པདྨ་བི་བྷཱུ་ཥཻ་ཏ།
en: Oṁ, O pure one adorned with lotuses!

source: ཤུད་དྷེ་དྷི་རི་དྷི་རི།
en: Dhiri dhiri!

source: ཨ་བ་ལོ་ཀི་ཡ་མཱ་ན།
en: Watch over me!

source: ས་མ་ས་མ། སརྦ་ཀརྨ་མེ་སཱ་དྷ་ཡ།
en: Sama sama, accomplish all my activities!

source: ཨ་མོ་གྷ་པྲ་ཤ་ཧྲྀ་ད་ཡ་སིད་དྷེ།
en: You are the perfect essence of Amoghapāśa.

source: གུ་ཧྱ་ནི་བ་སི་ནི་བར་ད་ཧཱུཾ་ཕཊ།
en: You live in a secret dwelling, O boon giver, hūṁ phaṭ!

source: གྲུབ་པ་དོན་ཡོད་པ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་བཤད་མ་ཐག་ཏུ་འབྱུང་པོའི་ཚོགས་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། བགེགས་དང་། ལོག་འདྲེན་དེ་དག་ཐམས་ཅད་ཁ་བུ་བ་ཏུ་འགྱེལ་ཏེ།
en: As soon as these kings of vidyās of Amoghasiddhi were spoken, the hordes of bhūtas, yakṣas, rākṣasas, vighnas, and vināyakas fell face down, consumed in one conflagration as their houses burst into flames.

source: གཅིག་ཏུ་འབར་བར་གྱུར་ཅིང་གནས་ཀྱང་འབར་བར་གྱུར་པ་དང་། དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་དགའ་བས་བ་སྤུ་ལངས་ཏེ།
en: Vajrapāṇi, on the other hand, the great yakṣa general, was thrilled and got goose bumps.

source: སྐྲག་པར་གྱུར་པའི་ལྷ་ཚོགས་ཐམས་ཅད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་།
en: The hosts of gods, including Śakra, Brahmā, Viṣṇu, Maheśvara, and the Four Great Kings, were all terrified, as were the lesser gods and asuras.
